In [ ]:
#.xlxs excel files
# 
#

In [49]:
import pandas as pd
import numpy as np
import openpyxl as op

In [8]:
df=pd.read_excel("C:\\Users\\jobin jose\\OneDrive\\Desktop\\NTTF AI ML\\day8\\sample_multi_sheet.xlsx")

In [9]:
df

   Sno  Year Team
0    1  2007  Aus
1    2  2011  Ind
2    3  2015  Aus
3    4  2019  Eng

In [12]:
df2=pd.read_excel("C:\\Users\\jobin jose\\OneDrive\\Desktop\\NTTF AI ML\\day8\\sample_multi_sheet.xlsx",sheet_name=1)

In [13]:
df2

   Sno  Year Team
0    1  2021  Aus
1    2  2022  Eng
2    3  2024  Ind

In [14]:
df3=pd.read_excel("C:\\Users\\jobin jose\\OneDrive\\Desktop\\NTTF AI ML\\day8\\sample_multi_sheet.xlsx",sheet_name=0)

In [15]:
df3

   Sno  Year Team
0    1  2007  Aus
1    2  2011  Ind
2    3  2015  Aus
3    4  2019  Eng

In [16]:
df3.index=["Row1","Row2","Row3","Row4"]

In [17]:
df3

      Sno  Year Team
Row1    1  2007  Aus
Row2    2  2011  Ind
Row3    3  2015  Aus
Row4    4  2019  Eng

In [29]:
df4=pd.read_excel("C:\\Users\\jobin jose\\OneDrive\\Desktop\\NTTF AI ML\\day8\\sample_multi_sheet.xlsx",sheet_name=[0,1,2])

In [30]:
df4

{0:    Sno  Year Team
 0    1  2007  Aus
 1    2  2011  Ind
 2    3  2015  Aus
 3    4  2019  Eng,
 1:    Sno  Year Team
 0    1  2021  Aus
 1    2  2022  Eng
 2    3  2024  Ind,
 2:    1  2010      Spain
 0  2  2014    Germany
 1  3  2018     France
 2  4  2022  Argentina}

In [22]:
df4[1]

   Sno  Year Team
0    1  2021  Aus
1    2  2022  Eng
2    3  2024  Ind

In [23]:
df4[0]

   Sno  Year Team
0    1  2007  Aus
1    2  2011  Ind
2    3  2015  Aus
3    4  2019  Eng

In [31]:
df5=pd.read_excel("C:\\Users\\jobin jose\\OneDrive\\Desktop\\NTTF AI ML\\day8\\sample_multi_sheet.xlsx",sheet_name=["Sheet_WC","Sheet_CT","WC"])

In [32]:
df5

{'Sheet_WC':    Sno  Year Team
 0    1  2007  Aus
 1    2  2011  Ind
 2    3  2015  Aus
 3    4  2019  Eng,
 'Sheet_CT':    Sno  Year Team
 0    1  2021  Aus
 1    2  2022  Eng
 2    3  2024  Ind,
 'WC':    1  2010      Spain
 0  2  2014    Germany
 1  3  2018     France
 2  4  2022  Argentina}

In [33]:
df5["Sheet_WC"]

   Sno  Year Team
0    1  2007  Aus
1    2  2011  Ind
2    3  2015  Aus
3    4  2019  Eng

In [34]:
df5["Sheet_CT"]

   Sno  Year Team
0    1  2021  Aus
1    2  2022  Eng
2    3  2024  Ind

In [35]:
df5["WC"]

   1  2010      Spain
0  2  2014    Germany
1  3  2018     France
2  4  2022  Argentina

In [36]:
#to_excel( )--can be used to create excel files

In [38]:
list1=[[1,220,"Spain"],[2,2014,"Germany"]]
df_list1=pd.DataFrame(list1,index=["R1","R2"],columns=["Sl.no","Year","Country"])

In [39]:
df_list1

    Sl.no  Year  Country
R1      1   220    Spain
R2      2  2014  Germany

In [43]:
df_list1.to_excel("football_wc.xlsx",index=False)

In [46]:
df_list1.to_excel("Football_DC_2.xlsx",index=False,header=None)

In [48]:
##now to write multyple sheet to excel file

In [50]:
list1= [[1,2010,"Spain"],[2,2014,"Germany"]]
list2 = [[3,2018,"France"], [4,2022,"Argentina"]]

In [52]:
df_list1

    Sl.no  Year  Country
R1      1   220    Spain
R2      2  2014  Germany

In [81]:
df_list2 = pd.DataFrame(list2, index=['R1','R2'],columns=['S.No','Year', 'Country'])

with pd.ExcelWriter('class_multi_sheet_write_3.xlsx') as xlwrite:
    df_list1.to_excel(xlwrite,sheet_name="first")
    df_list2.to_excel(xlwrite,sheet_name="second")

print("file created successfully")

file created successfully

In [75]:
df_list2

    S.No  Year    Country
R1     3  2018     France
R2     4  2022  Argentina

In [76]:
list3=[[1,2006,"italy"],[2,2002,"Brazil"]]

In [77]:
list4=[[1,2026,"India"],[2,2030,"India"]]

In [78]:

df_list3=pd.DataFrame(list3, index=['R3','R4'],columns=['S.No','Year', 'Country'])

In [79]:
df_list4=pd.DataFrame(list4, index=['R3','R4'],columns=['S.No','Year', 'Country'])

In [83]:
with pd.ExcelWriter('class_multi_sheet_write_3.xlsx',mode="a") as xlwrite:
    df_list3.to_excel(xlwrite,sheet_name="third")
    df_list4.to_excel(xlwrite,sheet_name="fourth")

print("file created successfully")

file created successfully

In [84]:
list45 = [[1,2010,"Spain"], [2,2014,"Germany"]]
df_list45 = pd.DataFrame( list45, index=["R1","R2"],columns=["C1","C2","C3"])
with pd.ExcelWriter("class_multi_sheet_write_3.xlsx" , mode="a") as xlwrite:
    df_list45.to_excel(xlwrite,sheet_name="fifth" )
print("Contents appended successfully!")

Contents appended successfully!

In [85]:
import numpy as np

In [91]:
obj=np.random.rand(10)
obj=obj.reshape(5,2)
print(obj.shape)
print(obj)

(5, 2)
[[0.31967467 0.17893984]
 [0.26913605 0.19206591]
 [0.06491672 0.03291072]
 [0.27457044 0.47024798]
 [0.81979408 0.73112674]]

In [92]:
import pandas as pd
from io import StringIO

# Define the data string with colons as delimiters
data_string = """Name:Gender: Age
Braund: male: 22
Cumings: female:38
Heikkinen: female: 26
Futrelle: female: 35"""

# Use StringIO to convert the string into a file-like object
data = StringIO(data_string)

# Read the data into a pandas DataFrame, specifying the delimiter as colon
df = pd.read_csv(data, delimiter=":")

# Display the DataFrame
print(df)

        Name   Gender   Age
0     Braund     male    22
1    Cumings   female    38
2  Heikkinen   female    26
3   Futrelle   female    35

In [93]:
df.sort_index(ascending=False)

        Name   Gender   Age
3   Futrelle   female    35
2  Heikkinen   female    26
1    Cumings   female    38
0     Braund     male    22

In [94]:
df.sort_index(axis=1)

    Age   Gender       Name
0    22     male     Braund
1    38   female    Cumings
2    26   female  Heikkinen
3    35   female   Futrelle

In [95]:
df["Age"]= [23,12,56,45]

In [96]:
df

        Name   Gender   Age  Age
0     Braund     male    22   23
1    Cumings   female    38   12
2  Heikkinen   female    26   56
3   Futrelle   female    35   45

In [97]:
df.index=["R1","R2","R3","R4"]

In [98]:
df

         Name   Gender   Age  Age
R1     Braund     male    22   23
R2    Cumings   female    38   12
R3  Heikkinen   female    26   56
R4   Futrelle   female    35   45

In [99]:
df["Country"]=["US","UK","India","Canada"]

In [100]:
df.sort_values(by="Age")

         Name   Gender   Age  Age Country
R2    Cumings   female    38   12      UK
R1     Braund     male    22   23      US
R4   Futrelle   female    35   45  Canada
R3  Heikkinen   female    26   56   India

In [104]:
df["R5"]=["Rohith","Female",45,12,"India"]

In [105]:
df

         Name   Gender   Age  Age Country      R5
R1     Braund     male    22   23      US  Rohith
R2    Cumings   female    38   12      UK  Female
R3  Heikkinen   female    26   56   India      45
R4     Rohith   Female    45   12   India      12
R5     Rohith   Female    45   12   India   India

In [107]:
df.drop(columns=["R5"])

         Name   Gender   Age  Age Country
R1     Braund     male    22   23      US
R2    Cumings   female    38   12      UK
R3  Heikkinen   female    26   56   India
R4     Rohith   Female    45   12   India
R5     Rohith   Female    45   12   India

In [111]:
df.sort_values(by=['Age',"Age"],ascending=False,kind='mergesort')

         Name   Gender   Age  Age Country      R5
R3  Heikkinen   female    26   56   India      45
R1     Braund     male    22   23      US  Rohith
R2    Cumings   female    38   12      UK  Female
R4     Rohith   Female    45   12   India      12
R5     Rohith   Female    45   12   India   India

In [ ]:
#concatenation in pandas 
# concatenation refers to joining two or more panda objects together 
#useful in cases where yuiu have to merge data from different sources or data sets
#the function provided to merge in pandas is ---- pd.concat()
#you can concatenate objects in either row values or column_wise manner

In [160]:
one = pd. DataFrame ({
'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung',"rohith" ],
'subject_id': ['sub1', 'sub2','sub4','sub6',"sub8",'sub5'],
'Marks_scored2':[98,90,87,99,69,78]},
index=[1,2,3,4,5,6])

two = pd.DataFrame({
'Name': ['Billy', 'Brian'  ],
'subject_id': ['sub2','sub4'],
'Marks_scored':[89,80]},
index=[1,2])

In [161]:
one

     Name subject_id  Marks_scored2
1    Alex       sub1             98
2     Amy       sub2             90
3   Allen       sub4             87
4   Alice       sub6             99
5  Ayoung       sub8             69
6  rohith       sub5             78

In [162]:
two

    Name subject_id  Marks_scored
1  Billy       sub2            89
2  Brian       sub4            80

In [165]:
result=pd.concat([one,two],axis=0,join="inner")

In [166]:
result

     Name subject_id
1    Alex       sub1
2     Amy       sub2
3   Allen       sub4
4   Alice       sub6
5  Ayoung       sub8
6  rohith       sub5
1   Billy       sub2
2   Brian       sub4

In [183]:
result2=pd.concat([one,two],axis=1,join="inner",ignore_index=False)

In [184]:
result2

   Name subject_id  Marks_scored2   Name subject_id  Marks_scored
1  Alex       sub1             98  Billy       sub2            89
2   Amy       sub2             90  Brian       sub4            80